jlpoltrack/stm32ll-lib/src/stdstm32-uartd.h
#elif defined UARTD_USE_UART5 || defined UARTD_USE_UART5_PC12PD2
  #define UARTD_UARTx             UART5
  #ifdef UARTD_USE_UART5
    // user needs to specify UARTD_USE_TX_IO, UARTD_USE_RX_IO, and possibly UARTD_USE_IO_AF
  #elif defined UARTD_USE_UART5_PC12PD2
    #define UARTD_TX_IO           IO_PC12
    #define UARTD_RX_IO           IO_PD2
  #endif
  #define UARTD_IRQn              UART5_IRQn
  #define UARTD_IRQHandler        UART5_IRQHandler
  #if defined STM32F1
    #define UARTD_IO_AF           IO_AF_DEFAULT
  #elif defined STM32F3
    #warning UARTD IO_AF & DMA for F3 still TODO //TODO
  #elif defined STM32F7
    #define UARTD_IO_AF           IO_AF_8
  #elif defined STM32G4
    #define UARTD_IO_AF           IO_AF_5
  #elif defined STM32C5
    #define UARTD_IO_AF           IO_AF_8
  #elif defined STM32L4
    #error TODO ?!?
  #elif defined STM32WL
    #error UART5 NOT AVAILABLE !
  #endif

#elif defined UARTD_USE_UART6 || defined UARTD_USE_UART6_PC6PC7 || defined UARTD_USE_UART6_PG14PG9
  #define UARTD_UARTx             USART6
  #ifdef UARTD_USE_UART6
    // user needs to specify UARTD_USE_TX_IO, UARTD_USE_RX_IO, and possibly UARTD_USE_IO_AF
  #elif defined UARTD_USE_UART6_PC6PC7
    #define UARTD_TX_IO           IO_PC6
    #define UARTD_RX_IO           IO_PC7
  #elif defined UARTD_USE_UART6_PG14PG9 // was UART6_REMAPPED
    #define UARTD_TX_IO           IO_PG14
    #define UARTD_RX_IO           IO_PG9
  #endif
  #define UARTD_IO_AF             IO_AF_8
  #define UARTD_IRQn              USART6_IRQn
  #define UARTD_IRQHandler        USART6_IRQHandler

  #if defined STM32F1 || defined STM32F3 || defined STM32G4 || defined STM32WL
    #error UART6 NOT AVAILABLE !
  #elif defined STM32F7
  #elif defined STM32L4
    #error TODO ?!?
  #elif defined STM32C5
    #error UART6 NOT AVAILABLE !
  #endif

#elif defined UARTD_USE_UART7 || defined UARTD_USE_UART7_PE8PE7 || defined UARTD_USE_UART7_PF7PF6
  #define UARTD_UARTx             UART7
  #ifdef UARTD_USE_UART7
    // user needs to specify UARTD_USE_TX_IO, UARTD_USE_RX_IO, and possibly UARTD_USE_IO_AF
  #elif defined UARTD_USE_UART7_PE8PE7
    #define UARTD_TX_IO           IO_PE8
    #define UARTD_RX_IO           IO_PE7
  #elif defined UARTD_USE_UART7_PF7PF6 // was UART7_REMAPPED
    #define UARTD_TX_IO           IO_PF7
    #define UARTD_RX_IO           IO_PF6
  #endif
  #define UARTD_IO_AF             IO_AF_8
  #define UARTD_IRQn              UART7_IRQn
  #define UARTD_IRQHandler        UART7_IRQHandler

  #if defined STM32F1 || defined STM32F3 || defined STM32G4 || defined STM32WL
    #error UART7 NOT AVAILABLE !
  #elif defined STM32F7
  #elif defined STM32L4
    #error TODO ?!?
  #elif defined STM32C5
    #error UART7 NOT AVAILABLE !
  #endif

#elif defined UARTD_USE_UART8 || defined UARTD_USE_UART8_PE1PE0
  #define UARTD_UARTx             UART8
  #ifdef UARTD_USE_UART8
    // user needs to specify UARTD_USE_TX_IO, UARTD_USE_RX_IO, and possibly UARTD_USE_IO_AF
  #elif defined UARTD_USE_UART8_PE1PE0
    #define UARTD_TX_IO           IO_PE1
    #define UARTD_RX_IO           IO_PE0
  #endif
  #define UARTD_IO_AF             IO_AF_8
  #define UARTD_IRQn              UART8_IRQn
  #define UARTD_IRQHandler        UART8_IRQHandler

  #if defined STM32F1 || defined STM32F3 || defined STM32G4 || defined STM32WL
    #error UART8 NOT AVAILABLE !
  #elif defined STM32F7
  #elif defined STM32L4
    #error TODO ?!?
  #elif defined STM32C5
    #error UART8 NOT AVAILABLE !
  #endif

#elif defined UARTD_USE_LPUART1 || defined UARTD_USE_LPUART1_PA2PA3 || defined UARTD_USE_LPUART1_PC1PC0 || \
      defined UARTD_USE_LPUART1_PA9PA10 || defined UARTD_USE_LPUART1_PB6PB7
  #define UARTD_UARTx             LPUART1
  #ifdef UARTD_USE_LPUART1
    // user needs to specify UARTD_USE_TX_IO, UARTD_USE_RX_IO, and possibly UARTD_USE_IO_AF
  #elif defined UARTD_USE_LPUART1_PA2PA3
    #define UARTD_TX_IO           IO_PA2
    #define UARTD_RX_IO           IO_PA3
    #ifdef STM32G4
      #define UARTD_IO_AF         IO_AF_12 // G4
    #elif defined STM32C5
      // C5 silicon swap: AF table has PA2=LPUART1_RX, PA3=LPUART1_TX (opposite of G4/WL).
      // override the TX/RX IO assignments above for C5.
      #undef UARTD_TX_IO
      #undef UARTD_RX_IO
      #define UARTD_TX_IO         IO_PA3
      #define UARTD_RX_IO         IO_PA2
      #define UARTD_IO_AF         IO_AF_3
    #else
      #define UARTD_IO_AF         IO_AF_8 // WL
    #endif
  #elif defined UARTD_USE_LPUART1_PC1PC0 // was LPUART1_REMAPPED
    #define UARTD_TX_IO           IO_PC1
    #define UARTD_RX_IO           IO_PC0
    #define UARTD_IO_AF           IO_AF_8
  #elif defined UARTD_USE_LPUART1_PA9PA10 // only C5, not swapped
    #define UARTD_TX_IO           IO_PA9
    #define UARTD_RX_IO           IO_PA10
    #define UARTD_IO_AF           IO_AF_3
  #elif defined UARTD_USE_LPUART1_PB6PB7 // only C5, not swapped
    #define UARTD_TX_IO           IO_PB6
    #define UARTD_RX_IO           IO_PB7
    #define UARTD_IO_AF           IO_AF_8
  #endif
  #define UARTD_IRQn              LPUART1_IRQn
  #define UARTD_IRQHandler        LPUART1_IRQHandler

  #if defined STM32F1 || defined STM32F3 || defined STM32F7
    #error LPUART1 NOT AVAILABLE !
  #elif defined STM32G4
  #elif defined STM32L4
    #error TODO ?!?
  #elif defined STM32WL
  #elif defined STM32C5
    // C5 has LPUART1 on PA2/PA3 (AF3, RX/TX swapped, handled above), PA9/PA10 (AF3) and
    // PB6/PB7 (AF8). PC0/PC1 are bonded up to LQFP64, but carry SPI2, not LPUART1.
    #if defined UARTD_USE_LPUART1_PC1PC0
      #error UARTD_USE_LPUART1_PC1PC0 not available on STM32C5, PC0/PC1 are not LPUART1 pins ! use UARTD_USE_LPUART1_PA9PA10 or UARTD_USE_LPUART1_PB6PB7
    #endif
  #endif

#else
  #error No UARTD_USE_UARTx defined!
#endif


// LPUART1 uses the LL_LPUART_xxx API instead of LL_USART_xxx, so several blocks below
// have to know which one was selected. define it once here rather than repeating the
// list of LPUART1 mappings at every use.
#if defined UARTD_USE_LPUART1 || defined UARTD_USE_LPUART1_PA2PA3 || defined UARTD_USE_LPUART1_PC1PC0 || \
    defined UARTD_USE_LPUART1_PA9PA10 || defined UARTD_USE_LPUART1_PB6PB7
  #define UARTD_IS_LPUART
#endif


// allows us to overwrite the default pin assignment
#ifdef UARTD_USE_TX_IO
  #undef UARTD_TX_IO
  #define UARTD_TX_IO             UARTD_USE_TX_IO
#endif
#ifdef UARTD_USE_RX_IO
  #undef UARTD_RX_IO
  #define UARTD_RX_IO             UARTD_USE_RX_IO
#endif
#ifdef UARTD_USE_IO_AF
  #undef UARTD_IO_AF
  #define UARTD_IO_AF             UARTD_USE_IO_AF
#endif


