jlpoltrack/stm32ll-lib/src/stdstm32-uartd.h
uint16_t uartd_putc(char c)
{
#ifndef UARTD_USE_TX_ISR
  while (!LL_USART_IsActiveFlag_TC(UARTD_UARTx)) {}
  LL_USART_TransmitData8(UARTD_UARTx, c);
  return 1;
#else
  uint16_t next = (uartd_txwritepos + 1) & UARTD_TXBUFSIZEMASK;
  if (uartd_txreadpos != next) { // fifo not full // this is isr safe, works also if readpos has changed in the meanwhile
    uartd_txbuf[next] = c;
    uartd_txwritepos = next;
    LL_USART_EnableIT_TXE(UARTD_UARTx); // enable interrupt // then TDR is empty, the TXE bit is set, and hence the isr is triggered
    return 1;
  }
  return 0;
#endif
}


void uartd_puts(const char *s)
{
  while (*s) {
    uartd_putc(*s);
    s++;
  }
}


void uartd_putbuf(uint8_t* buf, uint16_t len)
{
uint16_t i;

  for (i = 0; i < len; i++) uartd_putc(buf[i]);
}


#ifdef UARTD_USE_TX_ISR
uint16_t uartd_tx_notfull(void)
{
  uint16_t next = (uartd_txwritepos + 1) & UARTD_TXBUFSIZEMASK;
  return (uartd_txreadpos != next); // fifo not full // this is isr safe, works also if readpos has changed in the meanwhile
}


static inline uint16_t uartd_tx_isempty(void)
{
  if (uartd_txwritepos == uartd_txreadpos) return 1;
  return 0;
}


static inline void uartd_tx_flush(void)
{
  uartd_txwritepos = uartd_txreadpos = 0;
}
#else
static inline void uartd_tx_flush(void) {}
#endif

#endif // defined UARTD_USE_TX


//-------------------------------------------------------
// RX routines
//-------------------------------------------------------
#ifdef UARTD_USE_RX

static inline uint16_t uartd_rx_available(void)
{
  if (uartd_rxwritepos == uartd_rxreadpos) return 0; // fifo empty
  return 1;
}


uint16_t uartd_rx_bytesavailable(void)
{
int16_t d;

  d = (int16_t)uartd_rxwritepos - (int16_t)uartd_rxreadpos;
  return (d < 0) ? d + (UARTD_RXBUFSIZEMASK + 1) : d;
}


char uartd_getc(void)
{
  while (uartd_rxwritepos == uartd_rxreadpos) {};
  uartd_rxreadpos = (uartd_rxreadpos + 1) & UARTD_RXBUFSIZEMASK;
  return uartd_rxbuf[uartd_rxreadpos];
}


void uartd_getbuf(uint8_t* buf, uint16_t len)
{
uint16_t i;

  for (i = 0; i < len; i++) buf[i] = uartd_getc();
}


static inline char uartd_lookatnextc(void)
{
  return uartd_rxbuf[(uartd_rxreadpos + 1) & UARTD_RXBUFSIZEMASK];
}


static inline void uartd_rx_flush(void)
{
  uartd_rxwritepos = uartd_rxreadpos = 0;
}

#endif // defined UARTD_USE_RX


//-------------------------------------------------------
// INIT routines
//-------------------------------------------------------
// ATTENTION:
// LPUART does not support 0.5 or 1.5 stop bits !!

// helper, usually should not be called itself
void _uartd_initprotocol(uint32_t baud, UARTPARITYENUM parity, UARTSTOPBITENUM stopbits)
{
#if !(defined UARTD_IS_LPUART)
LL_USART_InitTypeDef UART_InitStruct = {};

  UART_InitStruct.BaudRate = baud;
  UART_InitStruct.DataWidth = (parity != XUART_PARITY_NO) ? LL_USART_DATAWIDTH_9B : LL_USART_DATAWIDTH_8B;
  UART_InitStruct.StopBits = stopbits;
  UART_InitStruct.Parity = parity;
  UART_InitStruct.TransferDirection = LL_USART_DIRECTION_TX_RX;
  UART_InitStruct.HardwareFlowControl = LL_USART_HWCONTROL_NONE;
  UART_InitStruct.OverSampling = LL_USART_OVERSAMPLING_16;
#if defined STM32G4 || defined STM32C5
  UART_InitStruct.PrescalerValue = LL_USART_PRESCALER_DIV1;
#endif

  LL_USART_Init(UARTD_UARTx, &UART_InitStruct);
#else
LL_LPUART_InitTypeDef UART_InitStruct = {};

  UART_InitStruct.BaudRate = baud;
  UART_InitStruct.DataWidth = (parity != LL_USART_PARITY_NONE) ? LL_LPUART_DATAWIDTH_9B : LL_LPUART_DATAWIDTH_8B;
  UART_InitStruct.StopBits = stopbits;
  UART_InitStruct.Parity = parity;
  UART_InitStruct.TransferDirection = LL_LPUART_DIRECTION_TX_RX;
  UART_InitStruct.HardwareFlowControl = LL_LPUART_HWCONTROL_NONE;
  UART_InitStruct.PrescalerValue = LL_LPUART_PRESCALER_DIV1;

  LL_LPUART_Init(UARTD_UARTx, &UART_InitStruct);
#endif
}


void uartd_setprotocol(uint32_t baud, UARTPARITYENUM parity, UARTSTOPBITENUM stopbits)
{
#if !(defined UARTD_IS_LPUART)
  LL_USART_Disable(UARTD_UARTx); // must be disabled to configure some registers
  _uartd_initprotocol(baud, parity, stopbits);
  LL_USART_Enable(UARTD_UARTx);
#else
  LL_LPUART_Disable(UARTD_UARTx); // must be disabled to configure some registers
  _uartd_initprotocol(baud, parity, stopbits);
  LL_LPUART_Enable(UARTD_UARTx);
#endif
}


void uartd_setbaudrate(uint32_t baud)
{
  uartd_setprotocol(baud, XUART_PARITY_NO, UART_STOPBIT_1);
}


void uartd_tx_enablepin(FunctionalState flag)
{
#ifdef UARTD_USE_TX
  if (flag == ENABLE) {
    gpio_change_af(UARTD_TX_IO, IO_MODE_OUTPUT_ALTERNATE_PP, UARTD_IO_AF, IO_SPEED_VERYFAST);
  } else {
    gpio_change(UARTD_TX_IO, IO_MODE_INPUT_ANALOG, IO_SPEED_VERYFAST);
  }
#endif
}


void uartd_rx_enableisr(FunctionalState flag)
{
#ifdef UARTD_USE_RX
  if (flag == ENABLE) {
    // Enable Receive Data register not empty interrupt
#if defined STM32F1
    LL_USART_ClearFlag_RXNE(UARTD_UARTx);
#endif
    LL_USART_ReceiveData8(UARTD_UARTx); // read DR to clear RXNE and error flags
    LL_USART_EnableIT_RXNE(UARTD_UARTx);
  } else {
    LL_USART_DisableIT_RXNE(UARTD_UARTx);
#if defined STM32F1
    LL_USART_ClearFlag_RXNE(UARTD_UARTx);
#endif
  }
#endif
}


void uartd_init_isroff(void)
{
  LL_USART_Disable(UARTD_UARTx);

  // Initialize clocks for USART/LPUART, GPIO, AFIO
  rcc_init_afio();
  rcc_init_uart(UARTD_UARTx);
#ifdef STM32F1
#if defined UARTD_USE_UART1_PB6PB7
  LL_GPIO_AF_EnableRemap_USART1();
#endif
#if defined UARTD_USE_UART2_PD5PD6
  LL_GPIO_AF_EnableRemap_USART2();
#endif
#if defined UARTD_USE_UART3_PC10PC11
  LL_GPIO_AF_RemapPartial_USART3();
#endif
#endif // STM32F1

  // Configure pin USART/LPUART Tx as alternative function push-pull
#ifdef UARTD_USE_TX
  gpio_init_af(UARTD_TX_IO, IO_MODE_OUTPUT_ALTERNATE_PP, UARTD_IO_AF, IO_SPEED_VERYFAST);
#endif

  // Configure pin USART/LPUART Rx as input with pull up
#ifdef UARTD_USE_RX
#ifndef UARTD_INVERTED
  gpio_init_af(UARTD_RX_IO, IO_MODE_INPUT_PU, UARTD_IO_AF, IO_SPEED_VERYFAST);
#else
  gpio_init_af(UARTD_RX_IO, IO_MODE_INPUT_PD, UARTD_IO_AF, IO_SPEED_VERYFAST);
#endif
#endif

  // Configure USART/LPUART
  _uartd_initprotocol(UARTD_BAUD, XUART_PARITY_NO, UART_STOPBIT_1);
#if !(defined UARTD_IS_LPUART)
  LL_USART_ConfigAsyncMode(UARTD_UARTx);
#if defined STM32G4
  LL_USART_DisableFIFO(UARTD_UARTx);
  LL_USART_SetTXFIFOThreshold(UARTD_UARTx, LL_USART_FIFOTHRESHOLD_1_8);
  LL_USART_SetRXFIFOThreshold(UARTD_UARTx, LL_USART_FIFOTHRESHOLD_1_8);
#elif defined STM32C5
  LL_USART_DisableFIFO(UARTD_UARTx);
  LL_USART_SetTXFIFOThreshold(UARTD_UARTx, LL_USART_FIFO_THRESHOLD_1_8);
  LL_USART_SetRXFIFOThreshold(UARTD_UARTx, LL_USART_FIFO_THRESHOLD_1_8);
#endif
#else
  LL_LPUART_DisableFIFO(UARTD_UARTx);
  LL_LPUART_SetTXFIFOThreshold(UARTD_UARTx, LL_LPUART_FIFOTHRESHOLD_1_8);
  LL_LPUART_SetRXFIFOThreshold(UARTD_UARTx, LL_LPUART_FIFOTHRESHOLD_1_8);
#endif

